{
  "status": "success",
  "founders": [
    {
      "name": "Kevin Groarke",
      "linkedin_url": "https://www.linkedin.com/in/kevin-groarke-1118318a/",
      "role_in_company": "CRO & Co-Founder",
      "background_summary": "Kevin Groarke is a Co-Founder and CRO at Shopthru.com with over 20 years of sales leadership experience, primarily focused on the fintech and payments sectors in the UK and Europe. His career is marked by senior roles at high-profile tech companies, including UK Sales Director at PayPal and Senior Sales Director EMEA at the VC-backed startup Juni. He was one of the first three employees to launch and scale Braintree in Europe, demonstrating strong go-to-market strategy and execution. Kevin is known for building high-performing sales teams based on culture, passion, and integrity, and has deep operational experience in both large corporations and high-growth startups.",
      "previous_companies": [
        {
          "company_name": "Juni",
          "role": "Senior Sales Director EMEA",
          "duration": null,
          "description": "Senior sales leadership at a VC-backed fintech startup.",
          "was_founder": false
        },
        {
          "company_name": "PayPal",
          "role": "UK Sales Director",
          "duration": null,
          "description": "Led UK sales for PayPal, a major global payments company.",
          "was_founder": false
        },
        {
          "company_name": "Braintree",
          "role": "Founding Team, Europe",
          "duration": null,
          "description": "One of the first three employees to launch and scale Braintree in Europe.",
          "was_founder": true
        }
      ],
      "education": null,
      "key_skills_and_expertise": null,
      "public_speaking_or_content": null,
      "investment_criteria_assessment": {
        "focus_industry_fit": true,
        "mission_alignment": null,
        "exciting_solution_to_problem": null,
        "founded_something_relevant_before": true,
        "impressive_relevant_past_experience": true,
        "exceptionally_smart_or_strategic": true,
        "assessment_summary": "Kevin Groarke has a strong track record in fintech and payments, with senior roles at PayPal and Juni, and was a founding team member for Braintree in Europe. He demonstrates impressive, relevant experience and strategic leadership, and has founded something relevant prior to Shopthru. Industry fit is clear, though mission alignment and the excitement of the current solution are not fully determined from available data."
      }
    },
    {
      "name": "Liz McGuinness",
      "linkedin_url": "https://www.linkedin.com/in/cooscaleup/",
      "role_in_company": "Chief Operating Officer",
      "background_summary": "Liz McGuinness is a seasoned executive operator with over 20 years of leadership experience across fintech, SaaS, ecommerce, and financial services. Her career trajectory shows a strong blend of corporate discipline, gained at American Express, and hands-on scale-up expertise. Notably, she served as COO at the fintech company Bink, where she was instrumental in its growth, and now holds the same position at shopthru, an embedded eCommerce tech company. Her content on LinkedIn highlights her professional focus on scaling operations and her personal mission of fostering community. She is also the co-founder of C-Suite Squad, a network for senior female leaders, which signals strong leadership, influence, and a commitment to impact-driven initiatives.",
      "previous_companies": [
        {
          "company_name": "Bink",
          "role": "Chief Operating Officer",
          "duration": null,
          "description": "Instrumental in the growth of the fintech company Bink.",
          "was_founder": false
        },
        {
          "company_name": "C-Suite Squad",
          "role": "Co-founder",
          "duration": null,
          "description": "Co-founder of a network for senior female leaders.",
          "was_founder": true
        },
        {
          "company_name": "American Express",
          "role": null,
          "duration": null,
          "description": "Corporate discipline and leadership experience.",
          "was_founder": false
        }
      ],
      "education": null,
      "key_skills_and_expertise": null,
      "public_speaking_or_content": null,
      "investment_criteria_assessment": {
        "focus_industry_fit": true,
        "mission_alignment": true,
        "exciting_solution_to_problem": true,
        "founded_something_relevant_before": true,
        "impressive_relevant_past_experience": true,
        "exceptionally_smart_or_strategic": true,
        "assessment_summary": "Liz McGuinness is a highly experienced operator with a strong track record in fintech, SaaS, and ecommerce. She has founded a relevant network (C-Suite Squad) and held impressive roles at Bink and American Express. Her leadership, strategic vision, and commitment to impact-driven initiatives make her a strong fit for investment criteria."
      }
    },
    {
      "name": "Matt Parkinson",
      "linkedin_url": "https://www.linkedin.com/in/mattparkinsonuk/",
      "role_in_company": "Co-Founder & CEO",
      "background_summary": "Matt Parkinson is a seasoned, serial entrepreneur with two decades of deep, hands-on experience in the e-commerce sector. His career demonstrates a clear trajectory of identifying market needs and building solutions, having founded multiple companies including Gene Commerce (a full-service e-commerce agency), Active Parity (a digital marketing agency), and his current ventures, shopthru and BlueFinch. This extensive background as a founder and CEO provides him with significant credibility and domain expertise in building and scaling e-commerce technology. His recent content on LinkedIn is highly focused and professional, targeting a B2B audience of e-commerce merchants and developers, particularly within the Adobe Commerce ecosystem. He effectively uses the platform to launch new products (BlueFinch), announce strategic partnerships (PayPal), and establish thought leadership around industry challenges. The tone is direct, confident, and solution-oriented, signalling a founder who is deeply embedded in his industry and understands the specific pain points of his customers. This focused activity and consistent engagement suggest a strong potential to build a founder-led brand.",
      "previous_companies": [
        {
          "company_name": "BlueFinch",
          "role": "Founder",
          "duration": null,
          "description": null,
          "was_founder": true
        },
        {
          "company_name": "Gene Commerce",
          "role": "Founder & CEO",
          "duration": null,
          "description": "Full-service e-commerce agency.",
          "was_founder": true
        },
        {
          "company_name": "Active Parity",
          "role": "Founder",
          "duration": null,
          "description": "Digital marketing agency.",
          "was_founder": true
        }
      ],
      "education": null,
      "key_skills_and_expertise": null,
      "public_speaking_or_content": null,
      "investment_criteria_assessment": {
        "focus_industry_fit": true,
        "mission_alignment": false,
        "exciting_solution_to_problem": true,
        "founded_something_relevant_before": true,
        "impressive_relevant_past_experience": true,
        "exceptionally_smart_or_strategic": true,
        "assessment_summary": "Matt Parkinson is a highly experienced serial entrepreneur in e-commerce, having founded multiple relevant companies prior to Shopthru. He demonstrates strong industry fit, a compelling founder-led approach, and impressive past experience. While his ventures are not specifically impact-driven, he is exceptionally smart and strategic, with a proven track record of building and scaling technology businesses."
      }
    },
    {
      "name": "Mark Wallman",
      "linkedin_url": "https://www.linkedin.com/in/markwallman/",
      "role_in_company": "Chief Technology Officer",
      "background_summary": "Mark Wallman is a seasoned technology leader with a deep specialisation in the e-commerce sector. His career shows a clear progression from technical and solutions architect roles to his current position as CTO of shopthru. His experience is rooted in building and delivering e-commerce solutions, demonstrated by his time at specialised companies like Spryker Systems, eShopWorld, and Gene Commerce.",
      "previous_companies": [
        {
          "company_name": "MW Ecom Solutions",
          "role": "Founder",
          "duration": null,
          "description": "Consultancy that worked with clients including Krispy Kreme UK",
          "was_founder": true
        },
        {
          "company_name": "Spryker Systems",
          "role": null,
          "duration": null,
          "description": "Experience in e-commerce solutions",
          "was_founder": false
        },
        {
          "company_name": "eShopWorld",
          "role": null,
          "duration": null,
          "description": "Experience in e-commerce solutions",
          "was_founder": false
        },
        {
          "company_name": "Gene Commerce",
          "role": null,
          "duration": null,
          "description": "Experience in e-commerce solutions",
          "was_founder": false
        }
      ],
      "education": [],
      "key_skills_and_expertise": [
        "E-commerce solutions",
        "Technology leadership",
        "Solutions architecture",
        "Technical architecture",
        "Product delivery",
        "Strategic vision"
      ],
      "public_speaking_or_content": null,
      "investment_criteria_assessment": {
        "focus_industry_fit": true,
        "mission_alignment": null,
        "exciting_solution_to_problem": true,
        "founded_something_relevant_before": true,
        "impressive_relevant_past_experience": true,
        "exceptionally_smart_or_strategic": true,
        "assessment_summary": "Mark Wallman meets most of the investment criteria with his strong technical background in e-commerce, having founded MW Ecom Solutions previously, and demonstrating impressive experience with companies like Spryker Systems, eShopWorld, and Gene Commerce. His profile suggests he is a builder-focused technical founder rather than a public-facing thought leader. While his industry fit and solution approach are strong, there is insufficient information to assess mission alignment."
      }
    }
  ],
  "founder_count": 4,
  "total_attempted": 4,
  "timestamp": "2025-06-23T19:11:17.225209"
}