{
  "status": "success",
  "company_profile": {
    "company_name": "emwillcare",
    "website": "https://www.emwillcare.com",
    "description": "Up to 90% of people living with dementia will experience distressed behaviour as a result of unmet needs, but the majority of it is preventable. We’ve built the first AI tool that predicts distressed behaviour in dementia care, before it happens, giving carers real-time & evidence-based support to prevent distress, prevent crises, reduce medication, and meet people's needs effectively.",
    "industry": "Healthcare & Life Sciences/ Health-tech",
    "sub_industry": "Healthcare & Life Sciences/ Health-tech",
    "location_hq": "UK but wanting to scale to US",
    "business_model": "There are currently no competitors in the field. I’m one of only 80 behaviour analysts in the whole world specialising in dementia care, and I’ve spent years working directly with carers, trying to stop distress before it spirals into crisis. However, there is only so many people I can help in-person.\r\n\r\n'Less Distress', by emwillcare takes my knowledge and expertise and is the first tool that actually predicts distressed behaviour using behavioural science and AI, not just tracking what’s already gone wrong, but helping carers know what to do next, in real time. This isn’t just innovation, it’s a lifeline for caregivers.\r\n\r\nWe are supported by the Alzheimer's Society Launchpad programme, and Business Wales Accelerator Growth Programme.",
    "target_customer": "B2B",
    "funding_stage": "I have a business that I want to scale",
    "total_funding_raised": "0",
    "team_size": null,
    "number_of_employees": "0-10",
    "which__if_any__of_the_un_sdg_17_goals_does_your_business_address_": "Good Health and Well-being",
    "does_your_product_contribute_to_a_healthier__happier_whole_human_experience_": "Yes",
    "how_does_your_product_contribute_to_a_healthier__happier_whole_human_experience_": "Less Distress is about making things better for everyone involved in dementia care: The person, the carer, and the family.\r\n\r\nAll behaviour happens for a reason. In dementia, that reason is often an unmet need, but it’s very hard for carers to understand what the need is without proper training (which they very rarely receive). We help carers see what the behaviour is trying to say, so they can respond in a way that meets the need, not just manages the reaction.\r\n\r\nWhen carers can predict distress before it happens, they can step in early and calmly, rather than reacting in crisis. Right now, when distressed behaviour is difficult for carers to support with, people are given unlicensed antipsychotics just to keep them sedated even though the side effects can be devastating: sedation, stroke, and death. It’s not person-centred care, it’s damage control.\r\n\r\nLess Distress helps change that. We give carers real tools, grounded in behavioural science, so they can reduce medication, prevent placement breakdowns, and support the person effectively. That means more dignity, more calm, and more moments where people feel understood, not lost.\r\n\r\nWhen it feels like no one cares...emwillcare",
    "how_does_your_company_use_innovation__through_technology_or_to_differentiate_the_business_model__": "We’re combining behavioural science with machine learning to do something that hasn’t been done before in dementia care: predict distressed behaviour before it happens.\r\n\r\nInstead of waiting for things to go wrong and reacting in crisis, Less Distress is an app that uses real-world care data to spot early warning signs and guide carers in real time. It’s personalised, preventative, and based on the science of why behaviour happens in the first place, something most systems completely ignore.\r\n\r\nOur innovation isn’t just in the tech, it’s in the model. We’re giving frontline carers access to the kind of behavioural insight that’s usually locked away in specialist services, and doing it in a way that’s fast, affordable, easy to use on the job, and a globally scalable solution.",
    "please_expand": "I’m not just looking for money, I’m looking for real partnership that brings not just funding, but support, mentorship, and guidance from people who’ve done this before and can help me take what I’ve started and turn it into something huge.\r\n\r\nThe AI company we’re working with built our prototype for free, and they’re still developing with us at no cost, because they believe in what we’re doing. It's the same with our marketing support. People are giving their time and skills because they’ve seen the impact that I have as a behaviour analyst, and they believe in me to make it happen.\r\n\r\nIn July, I’ll be pitching to investors for the first time at an Alzheimer’s Society event. I know my field, I’m one of only 80 behavioural analysts in the world who specialise in dementia. What I need now is someone who can help me build this into a service that’s available to everyone who needs it at a devastating time in their life.\r\n\r\nI’m here to deliver and I’m the right person for this job. I’ll be the best entrepreneur you’ve ever worked with. I care for the people I help and want to make their lives better on a wider scale than I can do in-person. I make change happen, I’ve done it all my life (I started my other business 4 years ago, the first behavioural consultancy business in the UK for dementia care). And now I’m ready to do it on a much bigger scale to help millions of people.",
    "what_is_it_that_you_re_looking_for_with_a_partnership_from_flight_": "Advice and support",
    "please_attach_your_pitch_deck": "https://api-eu1.hubspot.com/form-integrations/v1/uploaded-files/signed-url-redirect/241972526310?portalId=145458831&sign=8xy8NABPw0AeW8Z1BM2T9PB9sPQ%3D&conversionId=0470020b-17a8-48e5-ae87-0d56ea730f9c&filename=0470020b-17a8-48e5-ae87-0d56ea730f9c-0-2/please_attach_your_pitch_deck-LessDistress-PitchDeck.pdf",
    "key_metrics": {
      "LTM Revenue": "0",
      "Monthly Revenue": "0",
      "Current Raise Amount": "£250-500k",
      "Valuation": "£0-1m",
      "Prior Funding": "0",
      "Team Equity": "100",
      "Business Stage": "I have a business that I want to scale",
      "Founders": "Emma Williams (emma.williams@positiveageingconsultancy.co.uk)"
    }
  },
  "timestamp": "2025-06-20T11:05:13.447956"
}