{
  "company_name": "Sylvi",
  "website": "https://sylvi.in/",
  "linkedin_url": "https://in.linkedin.com/company/sylvi",
  "description": "Sylvi is an Indian luxury watch brand founded in 2015, dedicated to creating stylish, high-quality, and affordable timepieces for men and women. The company blends traditional craftsmanship with modern technology, offering a wide range of analog, chronograph, and digital watches. Sylvi is committed to making luxury accessible and celebrates Indian craftsmanship.",
  "industry": "Retail Luxury Goods and Jewelry",
  "sub_industry": "Watches and Accessories",
  "founded_year": 2015,
  "funding_stage": null,
  "total_funding_raised": null,
  "funding_rounds_details": null,
  "key_products_services": [
    "Chronograph Watches",
    "Multi-Function Sports Watches",
    "Dual Time Analog Watches",
    "Casual Digital Watches",
    "Slim and Sleek Watches",
    "Watch Straps"
  ],
  "business_model": "Direct-to-consumer e-commerce model, selling watches and accessories online via its website and digital platforms. The company focuses on affordable luxury, targeting value-conscious consumers with premium designs at accessible prices.",
  "target_customer": "Fashion-forward men and women in India, particularly Millennials and Gen Z, seeking affordable luxury and unique, stylish timepieces. The brand appeals to customers who value Indian craftsmanship and responsible manufacturing.",
  "key_metrics": {
    "Customer Base": "360,000+ satisfied patrons",
    "Team Size": "11-50 employees"
  },
  "team_size": "11-50 employees",
  "location_hq": "Surat, Gujarat, India",
  "other_locations": null,
  "mission_statement": "By 2040, Sylvi aims to establish itself as a globally recognized brand while proudly manufacturing in India. The mission is to ensure that every individual, regardless of their background, can own a Sylvi product—a symbol of luxury at exceptional value for money. Sylvi celebrates Indian craftsmanship and strives to capture 10% of the Indian population as loyal customers."
}